{
  "main": {
    "hello": "Hallo",
    "aboutMe": "Über mich",
    "my": "Meine",
    "myWorks": "Meine Arbeiten",
    "names": "heißt",
    "contacts": "Kontakte",
    "ivan": "Ivan",
    "performances": "Vorträge",
    "presPForPause": "Drücken Sie \"P\" für Pause. Drücken Sie \"Leertaste\" für einen neuen Effekt"
  },
  "about": {
    "helloThere": "Hallo zusammen!",
    "text": {
      "line1": "Schon als Kind träumte ich davon, Programmierer zu werden und etwas Spannendes zu schaffen. Nach meinen ersten Erfahrungen mit Basic, Pascal und Delphi nahm mein Leben zunächst einen anderen Weg. Doch 15 Jahre später erkannte ich, dass Programmieren meine wahre Berufung ist.",
      "line2": "",
      "line3": "Heute bin ich ein Senior-Frontend-Entwickler, spezialisiert auf die Entwicklung von Anwendungen, benutzerfreundliche Oberflächen und die Wartung von Webprojekten. Es bereitet mir Freude, komplexe Aufgaben in einfache, elegante und benutzerzentrierte Lösungen zu verwandeln.",
      "line4": "",
      "line5": "Mein beruflicher Werdegang umfasst die Arbeit mit modernen Technologien wie Next.js, React, TypeScript und verschiedenen Tools zur Effizienzsteigerung in der Entwicklung. Ich lerne ständig dazu, halte mich über die neuesten Trends und Technologien auf dem Laufenden und teile gerne mein Wissen mit meinem Team. In meiner Freizeit spiele ich gerne auf meiner PlayStation, experimentiere beim Fleischkochen und verbringe wertvolle Zeit mit meiner Familie.",
      "line6": "",
      "line7": "In allen Unternehmen, in denen ich gearbeitet habe, konnte ich meine Soft Skills unter Beweis stellen, gemeinsam mit dem Team Lösungen finden und meine Relevanz zeigen.",
      "line8": "Ich habe Erfahrung mit:"
    },
    "description": "Gleichzeitig lerne ich neue Technologien und versuche, dieses Wissen mit anderen zu teilen.",
    "whoIAm": "Wer ich bin:",
    "facts": {
      "line0": "Ich bin ein Teamplayer",
      "line1": "Ich genieße es, Probleme zu lösen",
      "line2": "Ich kommuniziere klar und effektiv",
      "line3": "Ich passe mich schnell an neue Technologien an",
      "line4": "Ich denke kreativ, um Lösungen zu finden",
      "line5": "Ich bin organisiert und verwalte meine Zeit gut",
      "line6": "Ich habe Führungserfahrung",
      "line7": "Ich liebe meine Familie",
      "line8": "Ich reise gerne",
      "line9": "Ich bin fröhlich",
      "line10": "Gesprächig",
      "line11": "Ich schaue gerne Serien",
      "line12": "Gesellig",
      "line13": "Optimist"
    },
    "downloadCv": "Lebenslauf herunterladen"
  },
  "contacts": {
    "sayHi": "Let's work together",
    "name": "Name",
    "message": "Nachricht",
    "sendMessage": "Nachricht senden",
    "messageSent": "Nachricht wurde gesendet!",
    "oopsError": "Upps! Beim Senden der Nachricht ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut."
  },
  "myWorks": {
    "myWorks": "Meine Arbeiten",
    "description": "Da ich in den Unternehmen, in denen ich gearbeitet habe, eine NDA (Geheimhaltungsvereinbarung) unterschrieben habe, muss ich hier meine persönlichen Projekte hochladen."
  },
  "performances": {
    "title": "Meine Vorträge",
    "regexp": "Habt keine Angst vor regulären Ausdrücken",
    "accessibility": "Entwicklung zugänglicher Benutzeroberflächen",
    "testingWithJest": "Testen mit Jest und Testing Library"
  },
  "accessibility": {
    "title": "Entwicklung zugänglicher Benutzeroberflächen",
    "linkName": "Link zum Vortrag"
  },
  "regexp": {
    "title": "Habt keine Angst vor regulären Ausdrücken",
    "linkName": "Nützliche Links",
    "wikiLink": "Reguläre Ausdrücke auf Wikipedia",
    "learnJS": "Leitfaden zu regulären Ausdrücken auf learn.javascript.ru",
    "crib": "Cheat-Sheet für reguläre Ausdrücke"
  },
  "jest": {
    "title": "Testen mit Jest und Testing Library",
    "usefulLinks": "Nützliche Links"
  },
  "404": {
    "title": "Seite nicht gefunden",
    "description": "Die angeforderte Seite existiert nicht. Sie können zur Startseite zurückkehren."
  },
  "works": {
    "english": {
      "title": "Englisch lernen",
      "text": {
        "line0": "Das Englischlernen ist das Ergebnis eines React-Marathons von Zaur Zakharov.",
        "line1": "Während dieses Marathons haben wir uns mit React und seinem Lebenszyklus vertraut gemacht und gelernt, mit Formularen und dem Firebase-Server zu arbeiten.",
        "line2": "Am Ende des Marathons habe ich gelernt, wie man mit Props und States arbeitet und diese zwischen den Komponenten hin- und herreicht.",
        "line3": "Zu Beginn haben wir unseren eigenen Redux geschrieben, um zu verstehen, wie es funktioniert, und haben ihn später integriert.",
        "line4": "Wir haben Icons und Formulare aus der AntDesign-Sammlung verwendet.",
        "line5": "Wir haben eine API für ein Wörterbuch eingebunden und Firebase Storage genutzt, um die Wörter der Benutzer zu speichern.",
        "line6": "Dann haben wir React Router und Thunk hinzugefügt.",
        "line7": "Um die Funktionen der Website zu nutzen, geben Sie ein unbekanntes englisches Wort in das Eingabefeld ein.",
        "line8": "Dieses Wort wird dann in der Firebase-Datenbank gespeichert und unter dem Eingabefeld angezeigt.",
        "line9": "Wenn Sie auf das Wort klicken, dreht sich die Karte um und auf der Rückseite finden Sie die Übersetzung.",
        "line10": "Sie können das Wort als gelernt durchstreichen oder als unnötig löschen und es somit aus Ihrer Wörter-Datenbank entfernen."
      },
      "login": "Login: reactmarathon@gmail.com",
      "password": "Passwort: 12345678"
    },
    "ganttChart": {
      "text": "Dies ist eine Testaufgabe. Hier verwende ich Technologien, die ich im vorherigen Projekt verwendet habe."
    },
    "miner": {
      "title": "Minesweeper",
      "text": "Ich habe einfach ein Miner-Spiel gemacht."
    },
    "pokedex": {
      "text": {
        "line0": "Pokedex ist das Ergebnis eines fortgeschrittenen React-Marathons von Zaur Zakharov.",
        "line1": "In diesem Marathon hat mir das Design und die neuen Technologien sehr gefallen.",
        "line2": "",
        "line3": "Das Design enthielt ein Kit - eine Sammlung von Farben, Verläufen und Schaltflächen.",
        "line4": "Das hat mir sehr geholfen, schneller zu arbeiten.",
        "line5": "Der Marathon begann mit der Wiederholung des Projekts für React Router und der Arbeit mit den URL-Parametern und den Routen. Wir haben React Query hinzugefügt.",
        "line6": "Am Ende haben wir unser Wissen über die Lebenszyklen und Hooks vertieft."
      }
    }
  }
}
